{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "The best mobility and flexibility drills are those that take the least amount of time to perform and deliver the most bang for your buck when it comes to getting you ready for your next workout.  In this video, I cover the 10 best mobility and flexibility drills that you can do prior to your workout as a quick 5 minute warmup that will get you ready to perform your best.

The added benefit of the exercises and stretches shown in this routine is that they all flow in one sequence.  You won’t need any equipment to do these and you will be able to do this anywhere.  No need to spend long doing this either.  The Matrix is meant to be completed in just minutes so that you can spend the rest of your time focusing on your training rather than turning your warmup into a workout in and of itself.

To start this flowing mobility routine you perform the inchworm for 10 reps.  The inchworm is a great drill for stretching out the entire posterior chain.  Reach down for the floor and begin walking your hands out away from your feet until you get into a full pushup position.  You aren’t just stretching your hamstrings and back (by trying to keep your knees pressed back) but you are working on your shoulder stabilization as well from the compression you get in your shoulders from the floor.

Next, you get into the 90/90 position for your hips.  This is a tremendous drill for hitting the internal and external rotators of the hips while getting the added benefit of a posterior shoulder capsule and lat stretch.  You aim for 5 reps on each leg here before smoothly moving onto the next exercise in the flow, the rolling crucifix.

This next mobility drill is great for working on the ability of your spine to assume proper mobility.  Keep your hands high overhead so you can reinforce the thoracic extension in your mid back as you reach and rotate your trunk.  You should feel rotation of the mid back as well and a release of the lumbar spine during every rep.

From here you proceed into the reverse table position and continue working on improving your thoracic rotation and extension while getting the additional activation of your glutes.  This overly dormant muscle group gets the benefit of being turned on and coordinates with an active stretch of the hip flexors on the other side of the joint during the press up portion of this exercise.

You next assume the standing position and perform the 3 way lunge.  The one two combination of having additional glute activation in multiple planes along with the stretch of the groin and adductor muscles is an incredible asset to this flowing matrix.  The adductors tend to get very tight but are also often times ignored when it comes to getting your legs ready for training.

The mobility drills and flexibility stretches continue and work on your shoulders, elbows, and ankles to finish out this 10 exercise routine.  No stone is left unturned and all of this can be done in less than ten minutes.  If you are looking for a way to get your body ready to train rather than using a warmup that winds up becoming a workout in and of itself, then you have found the solution in the Matrix.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FWarmUp%2F10%20Best%20Mobility%20Flexibility%20Drills%20(PRE-WORKOUT).mp4?alt=media&token=633e0f69-1cae-4d7a-82f4-eb4408e81165" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnailwarmup.jpg?alt=media&token=99975bb5-fc92-462e-9ce1-784a6ce8c81e",
      "title" : "10 Best Mobility Flexibility Drills"
    }, {
      "description" : "
Knee pain with squats is one of the most common reasons for either avoiding the leg exercise entirely or lifting far less than you should.  The reason for much of this pain is due to pain in the patellar tendons.  In this video, I show you not only the three things you want to do to make sure your tendons are properly warmed up and loose before you squat, but the exact routine I do that has been helping my knees feel much better.

To start, you have to make sure that you shorten the range of motion if you are going to work on your tendon readiness prior to squatting.  I’m talking about literally just a few inches of motion at the knee joint.  Next, you need to incorporate multidirectional movements into your routine.  Preferably, you want to include movements in all three planes of motion; front, sagittal, and transverse.  Finally, you want to be sure that you are not increasing the weights to two or three times what you would normally squat but rather less than what you would use.

If your tendons are really inflamed and stabbing when you try to squat, you will find that you can benefit from using no weights at all and simply performing the movements shown in this warmup circuit.  That said, here is what this leg and knee tendon warmup will look like.

Do just 10 reps of the following exercises to get your patellar tendons and knees feeling loose before you start squatting.

Partial Pulse Squats x 10 reps
Side Step Pulse Squats x 10 reps in each direction
Drop Step Pulse Squats x 10 reps in each direction
Jack Pulse Squats x 10 out and 10 reps in

The goal here is to stay in the terminal range of motion and not be afraid to make the movements a bit ballistic in nature.  Remember, your patellar tendons are going to need to be able to accommodate high level tensile forces if they are going to function properly.  This can be accomplished by performing the reps of this leg and knee pain warmup routine rather quickly.

Transition from exercise to exercise without resting and be sure to contract the quads and hamstrings as you perform each rep.  Try and perform this entire circuit two to three times before doing your first set of squats.  You can also opt to do this again at the end of the workout to flush a bit more blood to the area and keep the knees feeling loose after your heavy work.

Feel free to use the routine as a quick leg finisher as well immediately following a set of heavier squats, deadlifts, etc.  The burn will be appreciable and you will definitely feel the contraction.  Either way, this will quickly become your go-to knee warmup even if you don’t have knee pain.  It will just make you feel looser and more ready to attack your heavy sets.",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/WhatCarCanYouGetForAGrand.mp4" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnailwarmup1.jpg?alt=media&token=8ba71ddd-52f0-4e2f-abef-6b2b62bc71c5",
      "title" : "Warmup to Stop Knee Pain with Squats"
    } ]
  } ]
}
